pmo-dataset/mermaid/40.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	ParallelGateway_1{"+"} --> Service_4["Get quality data"]
	ParallelGateway_1 --> Service_3["Get availability\ndata"]
	ParallelGateway_1 --> Service_5["Get performance data"]
	Service_4 --> ParallelGateway_2{"+"}
	Service_3 --> ParallelGateway_2
	Service_5 --> ParallelGateway_2
	ParallelGateway_2 --> Service_6["Calculate OEE"]
	ExclusiveGateway_1{"OEE below 50%?"} -->|"Yes"| Service_1["Stop the machine"]
	Service_1 --> Service_2["Send email to an\nengineer"]
	StartNoneEvent_1(("OEE data required")) --> ParallelGateway_1
	Service_2 --> ExclusiveGateway_3{"Machine worth\nrepairing?"}
	Manual_2["Repair the issue"] --> ExclusiveGateway_5{"Remaining issues?"}
	Manual_3["Restart the machine"] --> Manual_1["Continue measuring"]
	ExclusiveGateway_2{"X"} --> EndNoneEvent_1(("Machine operating\nnormally / Machine\ndisconnected")):::endEvent
	Service_6 --> ExclusiveGateway_1
	ExclusiveGateway_3 -->|"No"| Manual_4["Disconnect the\nmachine"]
	ExclusiveGateway_4{"X"} --> ExclusiveGateway_2
	Manual_4 --> ExclusiveGateway_4
	Manual_1 --> ExclusiveGateway_4
	ExclusiveGateway_3 -->|"Yes"| ExclusiveGateway_6{"X"}
	ExclusiveGateway_5 -->|"No"| Manual_3
	ExclusiveGateway_6 --> Manual_2
	ExclusiveGateway_5 -->|"Yes"| ExclusiveGateway_6
	ExclusiveGateway_1 -->|"No"| ExclusiveGateway_2
